INSERT INTO Positions (Name) VALUES
('Чиф-барбер'),
('Синьор-барбер'),
('Джуниор-барбер');
INSERT INTO Services (Name, Price, DurationMinutes) VALUES
('Стрижка мужская', 1500, 60),
('Традиционное бритьё бороды', 1200, 40),
('Стрижка + борода', 2200, 90),
('Королевское бритьё', 2000, 60),
('Детская стрижка', 900, 30);
INSERT INTO Clients (LastName, FirstName, Phone, Email) VALUES
('Смирнов', 'Алексей', '79001234567', 'alex@mail.ru'),
('Кузнецова', 'Мария', '79007654321', 'maria@mail.ru'),
('Попов', 'Дмитрий', '79009998877', 'dmitry@mail.ru'),
('Иванова', 'Ольга', '79001112233', 'olga@mail.ru'),
('Соколов', 'Иван', '79004445566', 'ivan@mail.ru');
INSERT INTO Ratings (Name) VALUES
('Очень плохо'),
('Плохо'),
('Нормально'),
('Хорошо'),
('Великолепно');
INSERT INTO Barbers (LastName, FirstName, MiddleName, Gender, Phone, Email, BirthDate, HireDate, PositionId) VALUES
('Ковалёв', 'Сергей', 'Петрович', 'М', '79001112233', 'kovalev@barber.ru', '1990-05-15', '2018-03-01', 1),
('Морозов', 'Андрей', 'Иванович', 'М', '79002223344', 'morozov@barber.ru', '1988-08-20', '2019-06-15', 2),
('Волков', 'Дмитрий', 'Сергеевич', 'М', '79003334455', 'volkov@barber.ru', '1995-02-10', '2021-01-10', 2),
('Лебедев', 'Никита', 'Андреевич', 'М', '79004445566', 'lebedev@barber.ru', '2000-11-25', '2022-09-01', 3),
('Соловьёв', 'Максим', 'Олегович', 'М', '79005556677', 'solovev@barber.ru', '2002-07-07', '2023-05-20', 3);
INSERT INTO BarberServices (BarberId, ServiceId) VALUES
(1, 1), (1, 2), (1, 3), (1, 4),
(2, 1), (2, 2), (2, 4),
(3, 1), (3, 3), (3, 5),
(4, 1), (4, 5),
(5, 1), (5, 2);
INSERT INTO Schedules (BarberId, WorkDate, StartTime, EndTime) VALUES
(1, '2026-10-01', '09:00', '18:00'),
(2, '2026-10-01', '10:00', '19:00'),
(3, '2026-10-02', '09:00', '17:00'),
(4, '2026-10-02', '11:00', '20:00'),
(5, '2026-10-03', '09:00', '15:00');
INSERT INTO Appointments (ClientId, BarberId, ServiceId, AppointmentDate, StartTime, Status) VALUES
(1, 1, 1, '2026-10-01', '10:00', 'Завершён'),
(2, 2, 2, '2026-10-01', '11:00', 'Завершён'),
(3, 3, 3, '2026-10-02', '12:00', 'Завершён'),
(4, 4, 5, '2026-10-02', '13:00', 'Ожидает'),
(5, 5, 1, '2026-10-03', '14:00', 'Ожидает');
INSERT INTO VisitArchive (ClientId, BarberId, ServiceId, VisitDate, TotalCost, RatingId, Comment) VALUES
(1, 1, 1, '2026-10-01', 1500, 5, 'Отличная стрижка!'),
(2, 2, 2, '2026-10-01', 1200, 4, 'Хорошо побрили'),
(3, 3, 3, '2026-10-02', 2200, 5, 'Всё супер'),
(1, 1, 1, '2026-09-15', 1500, 4, 'Нормально'),
(1, 1, 1, '2026-08-10', 1500, 5, 'Лучший барбер!'),
(2, 2, 2, '2026-09-20', 1200, 3, 'Средне');
INSERT INTO Feedbacks (ClientId, BarberId, RatingId, Comment) VALUES
(1, 1, 5, 'Отличный мастер!'),
(2, 2, 4, 'Хорошо работает'),
(3, 3, 5, 'Всё понравилось'),
(1, 1, 5, 'Постоянно хожу только к нему'),
(2, 2, 3, 'Было лучше');